cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions' # For alternate cask versions
tap 'homebrew/bundle'
tap 'railwaycat/homebrew-emacsmacport'

cask 'xquartz' # Needs to be installed before wine

brew 'ack'
brew 'ansible'
brew 'ant'
brew 'awsebcli'
brew 'awscli'
brew 'boot-clj'
brew 'chrome-cli'
brew 'cloc'
brew 'cmake'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'dfu-util'
brew 'editorconfig'
brew 'emacs', args: ['--HEAD' '--use-git-head' '--with-cocoa' '--with-gnutls' '--with-rsvg' '--with-imagemagick']
brew 'ephemeralpg'
brew 'forego'
brew 'fish'
brew 'gcc'
brew 'git'
brew 'git-flow-avh'
brew 'gnupg2'
brew 'go'
brew 'graphviz'
brew 'grc'
brew 'heroku-toolbelt'
brew 'highlight'
brew 'hub'
brew 'hugo'
brew 'jq'
brew 'mas'
brew 'macvim', args: ['with-override-system-vim']
brew 'maven'
brew 'mercurial'
brew 'mitmproxy'
brew 'mosh'
brew 'node'
brew 'openssl'
brew 'packer'
brew 'pinentry-mac'
brew 'python'
brew 'readline'
brew 'rethinkdb'
brew 'rlwrap'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'tcping'
brew 'tmux'
brew 'tldr'
brew 'tree'
brew 'unrar'
brew 'v8'
brew 'watch'
brew 'z'
brew 'zsh'

cask '1password'
cask 'atom'
cask 'appcleaner'
cask 'backblaze'
cask 'backuploupe'
cask 'bartender'
cask 'cyberduck'
cask 'day-o'
cask 'emacs-mac'
cask 'fantastical'
cask 'filebot'
cask 'firefox'
cask 'flux'
cask 'github-desktop'
cask 'gitter'
cask 'gitup'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'handbrake'
cask 'harvest'
cask 'hex-fiend'
cask 'hocus-focus'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'jce-unlimited-strength-policy'
cask 'jumpcut'
cask 'karabiner'
cask 'kaleidoscope'
cask 'licecap'
cask 'nvalt'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'omnioutliner'
cask 'plex-home-theater'
cask 'plex-media-player'
cask 'plex-media-server'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicksilver'
cask 'rescuetime'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'taskpaper'
cask 'textexpander'
cask 'textmate'
cask 'textual'
cask 'the-unarchiver'
cask 'transmission'
cask 'tripmode'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'yourkit-java-profiler'
cask 'xscope'

# caskroom/versions
cask 'google-chrome-canary'

mas 'Boxy', id: 1053031090
mas 'Reeder', id: 880001334
mas 'Palua', id: 431494195
mas 'Xcode', id: 497799835
mas 'Pixelmator', id: 407963104
mas 'Deckset', id: 847496013
mas 'TextWrangler', id: 404010395
mas 'ScreenFloat', id: 414528154
mas 'Take Five', id: 424437399
mas 'Piezo', id: 440641508
mas 'Stars', id: 926319434
mas 'Tweetbot', id: 557168941
mas 'Deliveries', id: 924726344
mas 'Quiver', id: 866773894
mas 'Podcast Chapters', id: 1070963477
mas 'Radia', id: 509525864
mas 'SiteSucker', id: 442168834
mas 'BreakTime', id: 427475982
mas 'Coffitivity', id: 659901392
mas 'Calca', id: 635758264
mas 'Byword', id: 420212497
mas 'Marked 2', id: 890031187
mas 'Soulver', id: 413965349
mas 'Pages', id: 409201541
mas 'FileBot', id: 905384638
mas 'Gapplin', id: 768053424
mas 'Caffeine', id: 411246225
mas 'Kindle', id: 405399194
mas 'QuickCursor', id: 404035899
mas 'Numbers', id: 409203825
mas 'Irvue', id: 1039633667
