cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions' # For alternate cask versions
tap 'homebrew/bundle'

brew 'ack'
brew 'ansible'
brew 'ant'
brew 'awscli'
brew 'boot-clj'
brew 'chrome-cli'
brew 'cloc'
brew 'cmake'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'emacs', args: ['--HEAD' '--use-git-head' '--with-cocoa' '--with-gnutls' '--with-rsvg' '--with-imagemagick']
brew 'forego'
brew 'gcc'
brew 'git'
brew 'git-flow-avh'
brew 'gnupg'
brew 'go'
brew 'graphviz'
brew 'grc'
brew 'heroku-toolbelt'
brew 'hub'
brew 'hugo'
brew 'jq'
brew 'keybase'
brew 'macvim', args: ['with-override-system-vim']
brew 'maven'
brew 'mercurial'
brew 'mitmproxy'
brew 'mosh'
brew 'node'
brew 'openssl'
brew 'python'
brew 'readline'
brew 'rethinkdb'
brew 'rlwrap'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'tcping'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'z'
brew 'zsh'

cask '1password'
cask 'atom'
cask 'appcleaner'
cask 'backblaze'
cask 'backuploupe'
cask 'bartender'
cask 'cyberduck'
cask 'day-o'
cask 'fantastical'
cask 'filebot'
cask 'firefox'
cask 'flux'
cask 'github-desktop'
cask 'gitter'
cask 'gitup'
cask 'google-chrome'
cask 'handbrake'
cask 'harvest'
cask 'hex-fiend'
cask 'hocus-focus'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'jce-unlimited-strength-policy'
cask 'jumpcut'
cask 'karabiner'
cask 'kaleidoscope'
cask 'licecap'
cask 'nvalt'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'omnioutliner'
cask 'plex-home-theater'
cask 'plex-media-player'
cask 'plex-media-server'
cask 'quicksilver'
cask 'rescuetime'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'taskpaper'
cask 'textexpander'
cask 'textmate'
cask 'textual'
cask 'the-unarchiver'
cask 'transmission'
cask 'tripmode'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'yourkit-java-profiler'
cask 'xscope'

# caskroom/versions
cask 'google-chrome-canary'

# To manually install from MAS
# Boom
# Byword
# Caffeine
# Calca
# Coffitivity
# Deckset
# Deliveries
# Due
# Fantastical
# Kindle
# Palua
# Piezo
# Pixelmator
# Pocket
# Radia
# ReadKit
# Reeder
# ScreenFloat
# Soulver
# Sparrow
# Stars
# TextWrangler
# Textual 5
# Tweetbot
# Xcode
