cask_args appdir: '/Applications'

tap 'homebrew/cask-versions' # For alternate cask versions
tap 'homebrew/bundle'
tap 'railwaycat/homebrew-emacsmacport'
tap 'getsentry/tools'
tap 'domt4/autoupdate'

cask 'java' # Java is required for many other tools to be installed.

brew 'ack'
brew 'ansible'
brew 'ant'
brew 'aws-elasticbeanstalk'
brew 'awscli'
brew 'bat'
brew 'boot-clj'
brew 'chrome-cli'
brew 'cloc'
brew 'clojure'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dfu-util'
brew 'editorconfig'
# brew 'emacs', args: ['--HEAD' '--use-git-head' '--with-cocoa' '--with-gnutls' '--with-rsvg' '--with-imagemagick']
brew 'ephemeralpg'
brew 'forego'
brew 'fish'
brew 'fd' # GNU find replacement, used by Projectile
brew 'gcc'
brew 'git'
brew 'gnupg2'
brew 'go'
brew 'gradle'
brew 'graphviz'
brew 'grc'
brew 'highlight'
brew 'httpie'
brew 'hub'
brew 'hugo'
brew 'ispell'
brew 'jq'
brew 'ledger'
brew 'mas'
brew 'maven'
brew 'mercurial'
brew 'mitmproxy'
brew 'mosh'
brew 'node'
brew 'openssl'
brew 'packer'
brew 'parquet-tools'
brew 'pinentry-mac'
brew 'pipenv'
brew 'pup'
brew 'python'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'rethinkdb'
brew 'ripgrep'
brew 'rlwrap'
brew 'roundup'
brew 'ruby-build'
brew 'getsentry/tools/sentry-cli'
brew 'sbt'
brew 'spaceman-diff'
brew 'spark'
brew 'terraform'
brew 'tcping'
brew 'tmux'
brew 'tldr'
brew 'tree'
brew 'unrar'
brew 'v8'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'z'
brew 'zsh'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'appcleaner'
cask 'atext'
cask 'backblaze'
cask 'backuploupe'
cask 'bartender'
cask 'cyberduck'
cask 'choosy'
cask 'day-o'
cask 'emacs-mac'
cask 'fantastical'
cask 'filebot'
cask 'firefox'
cask 'flux'
cask 'fluor'
cask 'gitup'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'handbrake'
cask 'harvest'
cask 'hex-fiend'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'java' unless system "/usr/libexec/java_home --failfast"
# cask 'jce-unlimited-strength-policy'
cask 'jumpcut'
# cask 'karabiner'
cask 'kaleidoscope'
cask 'nvalt'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'omnioutliner'
cask 'postgres'
cask 'postico'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicksilver'
cask 'quitter'
cask 'skype'
cask 'slack'
cask 'taskpaper'
cask 'textexpander'
cask 'textual'
cask 'the-unarchiver'
cask 'transmission'
cask 'tripmode'
cask 'visual-studio-code'
cask 'vlc'
cask 'yourkit-java-profiler'

# caskroom/versions
cask 'google-chrome-canary'

# mas 'Palua', id: 431494195 # Not on App Store any more?
#mas 'Irvue', id: 1039633667
#mas 'QuickCursor', id: 404035899
#mas 'Quiver', id: 866773894
#mas 'TextWrangler', id: 404010395
#mas 'Tweetbot', id: 557168941
mas 'Byword', id: 420212497
#mas 'Caffeine', id: 411246225 # Not on App Store any more?
mas 'Calca', id: 635758264
mas 'Day One', id: 1055511498
mas 'Deckset', id: 847496013
mas 'Deliveries', id: 924726344
mas 'Gapplin', id: 768053424
mas 'Kindle', id: 405399194
mas 'Marked 2', id: 890031187
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 1449412482
mas 'ScreenFloat', id: 414528154
#mas 'Slack', id: 803453959
mas 'Soulver', id: 413965349
mas 'Stars', id: 926319434
mas 'Stars', id: 926319434
mas 'Textual 7', id: 1262957439
mas 'Clocker', id: 1056643111
